STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_MultiAppAt/STM32_WPAN/App/app_ble_sv.c
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;

  switch (event_pckt->evt)
  {
    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
    {
      hci_disconnection_complete_event_rp0 *disconnection_complete_event;
      disconnection_complete_event = (hci_disconnection_complete_event_rp0 *) event_pckt->data;

      if (disconnection_complete_event->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
      {
        BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
        BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
        SV_Connection_Status = APP_BLE_IDLE;
#if(CFG_DEBUG_APP_TRACE != 0)
        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH CLIENT \n");
#endif        
      }
      
      if (disconnection_status == TO_SWITCH_APP) //Disconnection done by application for switching app
      {
        handleNotification.P2P_Evt_Opcode = PEER_DISCON_SWITCH_HANDLE_EVT;
        handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
        P2PS_APP_Notification(&handleNotification);
      }
      else { //Deconnection done by user/client
         /* restart advertising */
//          Adv_Request(APP_BLE_FAST_ADV);
        
        PairingContext.PairingComplete = 0; //The pairing is reset to allow the user to perform a pairing on next connection
       /*
        * SPECIFIC to P2P Server APP
        */     
          handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PS_APP_Notification(&handleNotification);
      }

     

}

    break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
    {
      meta_evt = (evt_le_meta_event*) event_pckt->data;
      /* USER CODE BEGIN HCI_LE_META_EVT_CODE */

      /* USER CODE END HCI_LE_META_EVT_CODE */
      switch (meta_evt->subevent)
      {
        case HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE: 
#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("\r\n\r** CONNECTION UPDATE EVENT WITH CLIENT \n");
#endif
          /* USER CODE BEGIN HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE */

          /* USER CODE END HCI_LE_CONNECTION_UPDATE_COMPLETE_SUBEVT_CODE */
          break;
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
          {
          hci_le_connection_complete_event_rp0 *connection_complete_event;

          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
          
//          HW_TS_Stop(BleApplicationContext.Advertising_mgr_timer_Id);

#if(CFG_DEBUG_APP_TRACE != 0)
          APP_DBG_MSG("HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE for connection handle 0x%x\n",
          connection_complete_event->Connection_Handle);
#endif
            if (BleApplicationContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
            {
              /* Connection as client */
              BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
              SV_Connection_Status = APP_BLE_CONNECTED_CLIENT;
            }
            else
            {
              /* Connection as server */
              BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
              SV_Connection_Status = APP_BLE_CONNECTED_SERVER;
            }
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle =
                connection_complete_event->Connection_Handle;

          /* USER CODE BEGIN HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
 /*
* SPECIFIC to P2P Server APP
*/             
          handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PS_APP_Notification(&handleNotification);
/**/
          /* USER CODE END HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
          }
        break; /* HCI_HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }
    }
    break; /* HCI_HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      blecore_evt = (evt_blecore_aci*) event_pckt->data;
      /* USER CODE BEGIN HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

      /* USER CODE END HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
      switch (blecore_evt->ecode)
      {
      /* USER CODE BEGIN ecode */

      /* USER CODE END ecode */
/*
* SPECIFIC to P2P Server APP
*/
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
          mutex = 1;
          UART_App_SendData("\r\nOK\r\n", 6);
#endif
      /* USER CODE BEGIN ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE */

      /* USER CODE END ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE */
      break;
        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
#if(CFG_DEBUG_APP_TRACE != 0)
        APP_DBG_MSG("\r\n\r** ACI_GAP_PROC_COMPLETE_VSEVT_CODE \n");
#endif
        /* USER CODE BEGIN ACI_GAP_PROC_COMPLETE_VSEVT_CODE */

        /* USER CODE END ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        break; /* ACI_GAP_PROC_COMPLETE_VSEVT_CODE */
        
        /* Pairing */
//        case ACI_GAP_PASS_KEY_REQ_VSEVT_CODE:
//          aci_gap_pass_key_resp(BleApplicationContext.BleApplicationContext_legacy.connectionHandle, 1111);
//          break;
        case ACI_GAP_NUMERIC_COMPARISON_VALUE_VSEVT_CODE:
            UART_App_SendData("\r\n", 2);
            PairingContext.PairingConfirmRequested = 1;
            evt_numeric_value = (aci_gap_numeric_comparison_value_event_rp0 *)blecore_evt->data;
            numeric_value = evt_numeric_value->Numeric_Value;
            sprintf(numeric_value_str, "%d", (int)numeric_value);
            UART_App_SendData((char *)numeric_value_str, (uint8_t)(strlen(numeric_value_str)));
            UART_App_SendData(":PREQ?\r\n", 8);
//            APP_DBG_MSG("numeric_value = %x\n", numeric_value);
//            aci_gap_numeric_comparison_value_confirm_yesno(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,0x01);
        break;
        
        case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE: //aci_gap_pairing_complete_event_process
            pairing_complete = (aci_gap_pairing_complete_event_rp0*)blecore_evt->data;
//            APP_DBG_MSG("BLE_CTRL_App_Notification: ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE, pairing_complete->Status = %d\n",pairing_complete->Status);
            if (pairing_complete->Status == 0)
            {
              UART_App_SendData("\r\nP\r\n", 5);
              PairingContext.PairingComplete = 1;
            }
            else UART_App_SendData("\r\nF\r\n", 5);
        break;
        
